Revit 2027 API
BuiltInFailures.SketchFailures.InvalidSketch Property
 Sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSketch { get; }
Public Shared ReadOnly Property InvalidSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSketch {
	FailureDefinitionId^ get ();
}
static member InvalidSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace